+++
title = "chapter 6: deep learning"
mathjax = "true"
tikzjax = "true"
date = "2025-04-14"
toc = "true"
clocal = "true"
tags = ["cnn", "theano", "relu", "dropout", "regularisation", "overfitting", "augmented-data"]
+++

{{< tikz >}}


\begin{tikzpicture}[x=1.6cm,y=1.1cm]
  \large
  \message{^^JDeep convolution neural network}
  
  % Define colors
  \colorlet{myred}{red!80!black}
  \colorlet{myblue}{blue!80!black}
  \colorlet{mygreen}{green!60!black}
  \colorlet{myorange}{orange!70!red!60!black}
  \colorlet{mydarkred}{red!30!black}
  \colorlet{mydarkblue}{blue!40!black}
  \colorlet{mydarkgreen}{green!30!black}
  
  % Define TikZ styles
  \tikzset{
    >=latex, % for default LaTeX arrow head
    node/.style={thick,circle,draw=myblue,minimum size=22,inner sep=0.5,outer sep=0.6},
    node in/.style={node,green!20!black,draw=mygreen!30!black,fill=mygreen!25},
    node hidden/.style={node,blue!20!black,draw=myblue!30!black,fill=myblue!20},
    node convol/.style={node,orange!20!black,draw=myorange!30!black,fill=myorange!20},
    node out/.style={node,red!20!black,draw=myred!30!black,fill=myred!20},
    connect/.style={thick,mydarkblue}, %,line cap=round
    connect arrow/.style={-{Latex[length=4,width=3.5]},thick,mydarkblue,shorten <=0.5,shorten >=1}
  }
  
  % Define layers and nodes
  \def\layerNodes{{5,5,4,3,2,4,4,3}} % Number of nodes in each layer
  \def\NC{6} % number of convolutional layers
  \def\totalLayers{8} % total number of layers
  
  % Node style mapping
  \tikzset{ % node styles, numbered for easy mapping with \nstyle
    node 1/.style={node in},
    node 2/.style={node convol},
    node 3/.style={node hidden},
    node 4/.style={node out},
  }
  
  % TRAPEZIA
  \draw[myorange!40,fill=myorange,fill opacity=0.02,rounded corners=2]
    (1.6,-2.7) --++ (0,5.4) --++ (3.8,-1.9) --++ (0,-1.6) -- cycle;
  \draw[myblue!40,fill=myblue,fill opacity=0.02,rounded corners=2]
    (5.6,-2.0) rectangle++ (1.8,4.0);
** DONE adding a second conv-pool layer:
CLOSED: [2025-04-14 Mon 13:06]
:LOGBOOK:
- State "DONE"       from              [2025-04-14 Mon 13:06]
:END:

#+begin_src python
net = Network([
    ConvPoolLayer(
	image_shape=(mini_batch_size, 1, 28, 28),
	filter_shape=(20,1,5,5),poolsize=(2,2)),
    ConvPoolLayer(
	image_shape=(mini_batch_size, 20, 12, 12),
	filter_shape=(40,20,5,5),poolsize=(2,2)),
    FullyConnectedLayer(n_in=40*4*4, n_out=100),
    SoftmaxLayer(n_in=100, n_out=10)], mini_batch_size)
>>> net.SGD(training_data, 60, mini_batch_size, 0.1, validation_data, test_data)
#+end_src

#+RESULTS:
Epoch 59: validation accuracy 98.94%
Finished training network.
Best validation accuracy of 98.94% obtained at iteration 259999
Corresponding test accuracy of 98.98%


** DONE changing to relu activation function:
CLOSED: [2025-04-14 Mon 14:34]
:LOGBOOK:
- State "DONE"       from "WAIT"       [2025-04-14 Mon 14:34]
- State "WAIT"       from              [2025-04-14 Mon 13:06]
:END:

#+begin_src python
  from network3 import ReLU
  net = Network([
      ConvPoolLayer(
	  image_shape=(mini_batch_size, 1, 28, 28),
	  filter_shape=(20,1,5,5),poolsize=(2,2), activation_fn=ReLU),
      ConvPoolLayer(
	  image_shape=(mini_batch_size, 20, 12, 12),
	  filter_shape=(40,20,5,5),poolsize=(2,2), activation_fn=ReLU),
      FullyConnectedLayer(n_in=40*4*4, n_out=100, activation_fn=ReLU),
      SoftmaxLayer(n_in=100, n_out=10)], mini_batch_size)
  net.SGD(training_data, 60, mini_batch_size, 0.03, validation_data, test_data, lmbda=0.1)
#+end_src

#+RESULTS:
:Epoch 59: validation accuracy 99.12%
:Finished training network.
:Best validation accuracy of 99.13% obtained at iteration 199999
:Corresponding test accuracy of 99.19%


** DONE augment training data:
CLOSED: [2025-04-14 Mon 21:43]
:LOGBOOK:
- State "DONE"       from "WAIT"       [2025-04-14 Mon 21:43]
- State "WAIT"       from "TODO"       [2025-04-14 Mon 15:11]
:END:

minor but significant! move each image 1 pixel up/down/left/right

#+begin_src python
  python expand_mnist.py
  expanded_training_data, _, _ = network3.load_data_shared("../data/mnist_expanded.pkl.gz")
  net = Network([
      ConvPoolLayer(
	  image_shape=(mini_batch_size, 1, 28, 28),
	  filter_shape=(20,1,5,5),poolsize=(2,2), activation_fn=ReLU),
      ConvPoolLayer(
	  image_shape=(mini_batch_size, 20, 12, 12),
	  filter_shape=(40,20,5,5),poolsize=(2,2), activation_fn=ReLU),
      FullyConnectedLayer(n_in=40*4*4, n_out=100, activation_fn=ReLU),
      SoftmaxLayer(n_in=100, n_out=10)], mini_batch_size)
  net.SGD(expanded_training_data, 60, mini_batch_size, 0.03, validation_data, test_data, lmbda=0.1)
#+end_src

#+RESULTS:
Epoch 59: validation accuracy 99.39%
Finished training network.
Best validation accuracy of 99.40% obtained at iteration 1449999
Corresponding test accuracy of 99.36%

** DONE dropout (regularisation)
CLOSED: [2025-04-16 Wed 21:01]
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-04-16 Wed 21:01]
:END:

#+begin_src python
     net = Network([
	 ConvPoolLayer(
	     image_shape=(mini_batch_size, 1, 28, 28),
	     filter_shape=(20,1,5,5),poolsize=(2,2), activation_fn=ReLU),
	 ConvPoolLayer(
	     image_shape=(mini_batch_size, 20, 12, 12),
	     filter_shape=(40,20,5,5),poolsize=(2,2), activation_fn=ReLU),
	 FullyConnectedLayer(n_in=40*4*4, n_out=1000, activation_fn=ReLU, p_dropout=0.5),
	 FullyConnectedLayer(n_in=1000, n_out=1000, activation_fn=ReLU, p_dropout=0.5),
	 SoftmaxLayer(n_in=1000, n_out=10, p_dropout=0.5)
     ], mini_batch_size)
     >>> net.SGD(expanded_training_data, 40, mini_batch_size, 0.03, validation_data, test_data, lmbda=0.1)
#+end_src

#+RESULTS:
Epoch 39: validation accuracy 99.54%
Finished training network.
Best validation accuracy of 99.62% obtained at iteration 874999
Corresponding test accuracy of 99.60%


